<template>
  <div class="container" ref="container">
    <main>
      <h1>ASCII Images <span></span></h1>

      <p>
        Привет! Надеюсь, что нажимая на значок вопроса внизу, Вы не ожидали
        увидеть здесь раздел поддержки пользователей или чего-то в этом роде...
        Я просто хотел пояснить, как работает все это великолепие и немного
        рассказать про рисунки текстом в целом.
      </p>
      <details>
        <summary><h3>Про ASCII Art</h3></summary>
        <div class="wrapper">
          <p>
            Как ни странно, делать картинки текстом люди начали сразу, как
            только появилась писменость. Позже это дело перешло в написание
            стихов. Ещё древнегреческий поэт Симмий Родосский писал
            стихотворения в форме яйца, секиры и крыльев, с соответствующим
            форме содержанием. Такие произведения искусства нам известны с III
            века до н.э. Дальше все это дело назвали фигурными стихами, и писали
            довольно долго, а в прочем, их и сейчас пишут. Но наибольшую
            популярность они сыскали у символистов и авангардистов, так что
            сейчас можно полюбоваться на фигурные стихи Державина, Сумарокова,
            Ржевского, Апухтина, Рукавишникова и многих-многих других поэтов
            прошлого.
          </p>
          <section>
            <p>
              Ну а с появлением типографии началась эра ASCII Art'а. Даже
              писались книги по созданию изображений символами! Посмотрите на
              одну из иллюстраций из книги "Art Typing", автора Nathan Krevolin.
              В книге в основном используются лишь несколько символов для
              создания всего рисунка. Такие изображения стали началом
              современного искусства создания текстовых картин.
            </p>
            <div class="illustration">
              <img src="@/assets/info/i1.svg" alt="" />
            </div>
          </section>
          <section>
            <p>
              Годы шли и такое искусство развилось в нечто невообразимое. А
              художников стало великое множество, увы не многие работы
              сохранились до наших дней, многие сайты на которых размещались
              подобные рисунки уже давно канули в бездну, а жаль. Картины стали
              гораздо детальнее, в них использовались разные символы и, к тому
              же, не требовали моноширинности шрифта, вот, к примеру не самая
              сложная, но довольно показательная работа.
            </p>
            <div class="illustration">
              <img src="@/assets/info/i2_1.svg" alt="" />
            </div>
          </section>
          <section>
            <p>
              А были умельцы, которые могли вручную создавать огромные "полотна"
              и поражать воображение каждого, кто видел их работы. Такие картины
              требовали большого труда, таланта и усидчивости, потому это
              интернет-ремесло и стали называть искусством. И как подобает всему
              прекрасному, сложному и удивительному, искусство создания ASCII
              картин стало деградировать. Однако оно все еще осталось в нашей
              жизни как просто прикольные текстовые картинки, на которых часто
              изображается что-то "мемное", милое, смешное или даже абсурдное.
              По сути, настоящее интернет-искусство. И хотя мастера ASCII Art'a
              уже давно не те, текстовые изображения продолжают нас периодически
              радовать, всплывая где-то в комментариях к постам, в сообщениях, в
              статусах подростков в социальных сетях, в блогах или в тредах.
            </p>
            <div class="illustration">
              <img src="@/assets/info/i3.svg" alt="" />
            </div>
          </section>
          <section>
            <p>
              Уже давно мы начали оцифровывать все, что плохо лежит и
              произведения художественного искусства не стали исключением.
              Сейчас в интернете можно найти изображения практически всего что
              душе угодно. Жители интернета - люди пытливые, потому сразу
              смекнули, что эти изображения можно программно рисовать с помощью
              текста, тем самым толкнув ASCII Art еще дальше. Хотя уже может
              показаться, что все это - баловство и ничего более, факт остается
              фактом - людям нравится подобное искусство, и хоть раз в жизни
              современный человек с доступом в интернет проведет несколько
              десятков минут изучая эти работы и возможно, сам попробует что-то
              нарисовать текстом.
            </p>
            <div class="illustration">
              <img src="@/assets/info/i4.svg" alt="" />
            </div>
          </section>
        </div>
      </details>
      <details>
        <summary>
          <h3>Как все работает</h3>
        </summary>
        <div class="wrapper">
          <p>
            Возможно, это будет кому-то интересно, потому опишу основные этапы
            преобразования изображения в текст. Процесс довольно прост в теории,
            но на практике есть некоторые подводные камни.
          </p>
          <section>
            <h3>Сжатие</h3>
            <p>
              Все начинается с масштабирования и приведения к растровому
              формату. Благо в растр браузеры отлично переводят сами,
              собственно, также, как и сжимают изображение до нужного размера,
              поэтому статью про сжатие и декартовы косинусные преобразования
              Фуре тут писать незачем. Но для пытливых умов оставлю
              <a
                target="_blank"
                href="https://pikabu.ru/story/kak_ustroen_format_jpeg_5452388"
              >
                ссылочку</a
              >
              на статью, где рассказывается про сжатие JPEG, и скажу, что суть
              сжатия заключается в объединении некоторой области из нескольких
              пикселей в один пиксель на основании расчета среднего значения по
              каждому из цветовых каналов.
              <br />
              Кстати, правильное сжатие нам необходимо, поскольку на данном
              этапе и определяется размер будущего изображения: хотим получить
              текст 300х200 символов – сжимаем до соответствующего состояния в
              пикселях. В данном конвертере во имя адаптивности размер выходного
              изображения зависит от размера окна и выбранного размера шрифта,
              чтобы все выглядело не так шакально, как в генераторах и
              конвертерах на других довольно старых сайтах.
            </p>
          </section>
          <section>
            <h3>Расчет яркости</h3>
            <p>
              Далее дело за малым, надо каждому цвету поставить в соответствие
              определенный символ. Здесь сложность состоит в том, что нужно
              правильно рассчитать яркость каждого пикселя, ведь они имеют 3
              цветовых индекса, а именно R (red), G (green), B (blue); и
              коэффициент непрозрачности A (alpha) причем все это они принимают
              значения от 0 до 255. Существует несколько формул для расчета
              яркости пикселя для каналов RGB. В данном конвертере яркость
              рассчитывается по формуле
              <span class="highlighted">
                L = 0.2126R + 0.715G + 0.0722B
              </span>
              Так получается значение в том же диапазоне от 0 до 255.
              <br />
              Далее определяемся со списком используемых символов. У нас их 70:
              <br />
              <span class="highlighted">
                $ @ B % 8 & W M # * o a h k b d p q w m Z O 0 Q L C J U Y X z c
                v u n x r j f t / \ \ | ( ) 1 { } [ ] ? - _ + ~ {{ char1 }} > i
                ! l I ; : , " ^ \ ` ' . и пробел
              </span>
              В массиве они нумеруются с 0 потому последний элемент (пробел)
              стоит под номером max = 69.
              <br />
              Теперь округлив до целого результат выражения (L / 255 * max)
              получим индекс символа, которому соответствует яркость L пикселя.
            </p>
          </section>
          <section>
            <h3>Контрастность</h3>
            <p>
              Настройка контрастности – тоже довольно важный этап, ведь такие
              расчеты вовсе не идеальны, в зависимости от размеров изображения
              все меняется, и у разных пользователей результат конвертера может
              (и будет) отличаться, в разных случаях мы можем получить картинку,
              детали в которой будут не сильно различимы в ч/б из-за сжатия,
              приближенной формулы, шрифта, или даже неправильной постановки
              символов в массиве. Кстати про символы, если использовать не ASCII
              а ANSI символы, можно добиться более точной предачи оттенков. ANSI
              Art появился чуть позже как расширение ASCII. И сейчас генераторы
              текстовых изображений используют как раз ANSI. Так корректируя
              контрастность исходной картинки можно добиться более четкого
              представления деталей на определенном устройстве.
            </p>
          </section>
          <section>
            <h3>Инверсия цветов</h3>
            <p>
              Последняя деталь, которая иногда портит результат – это
              прозрачность, которая не учитывается при расчете яркости. Обычно
              при полной прозрачности пиксели имеют нули в коэффициентах
              цветовых каналов, и в итоге вычисления яркости мы получим 0, из-за
              этого прозрачный фон становится черным. Не найдя приличных формул
              для вычисления яркости по RGBA, я принял решение сделать
              возможность инвертирования, которая в подобных случаях может
              сменить черный фон на белый и контуры будут более различимыми.
              Возможно, позже я автоматизирую процесс преобразования прозрачных
              черных пикселей в белые, добавлю опцию выбора ANSI/ASCII и жизнь
              станет проще. Очень надеюсь, что прочтение данной статьи не стало
              пустой тратой времени, и Вы узнали для себя что-то интересное или
              новое.
            </p>
          </section>
        </div>
      </details>
    </main>
    <Footer />
  </div>
</template>

<script>
import Footer from "@/components/Footer.vue";

export default {
  components: {
    Footer
  },
  data() {
    return {
      char1: "<"
    };
  },
  mounted() {
    // alert(window.innerHeight);
    this.$refs.container.style.minHeight = window.innerHeight + "px";
  }
};
</script>

<style lang="scss" scoped>
a {
  display: inline-block;
  text-decoration: none;
  background: var(--dark-text);
  color: var(--bgColor);
  padding: 0px 7px;
  border-radius: 4px;
  transition: 0.3s;
  &:hover {
    background: var(--normal-text);
  }
}
main {
  display: flex;
  flex-direction: column;
}

.container {
  display: flex;
  flex-direction: column;
  justify-content: space-between;
  font-family: "Courier New Cyr", "Courier New", Courier, monospace;
  width: 90%;
  margin: 0 auto;
  padding: 20px;
  font-size: 20px;
  text-align: justify;
  color: var(--dark-text);
  position: relative;
  min-height: 95vh;

  .wrapper {
    display: flex;
    flex-wrap: wrap;
    gap: 20px;
  }

  section {
    display: flex;
    flex-direction: column;
    width: calc(50% - 10px);
    border: 1px solid var(--dark-text);
    border-radius: 8px;
    overflow: hidden;
    box-sizing: border-box;
    align-items: center;
    padding: 0;

    h3 {
      font-size: 1.3em;
      line-height: 1em;
      margin: 20px 0 0 20px;
      padding: 0;
      align-self: start;
    }

    .highlighted {
      display: block;
      margin: 5px auto;
      width: fit-content;
      // background: var(--dark-text);
      text-align: center;
      // color: var(--bgColor);
      border-radius: 4px;
      padding: 2px 7px;
    }

    .illustration {
      width: 100%;
      display: flex;
      justify-content: center;
      align-items: center;
      padding: 10px;
      height: 100%;
      img {
        filter: contrast(2);
        width: 70%;
        max-height: 450px;
      }
    }
  }
}

h3 {
  color: var(--dark-text);
  display: inline;
  line-height: 2em;
  font-size: 1.3em;
}

p {
  padding: 20px;
  line-height: 1.3em;
  border-radius: 8px;
  font-weight: bold;
}

details {
  margin-top: 1em;
  transition: 0.3s;
  summary {
    width: fit-content;
    transition: 0.3s;
    outline: none;
    cursor: pointer;
    h3 {
      padding: 2px 7px;
      border-radius: 4px;
    }
    &:hover > h3 {
      transition: 0.3s;
      background: var(--normal-text);
      color: var(--bgColor);
    }
  }
}

details[open] > div {
  z-index: 200;
  animation-name: slideDown;
  animation-duration: 0.3s;
  animation-fill-mode: forwards;
}
details[open] > summary > h3 {
  background: var(--dark-text);
  color: var(--bgColor);
}

@keyframes slideDown {
  0% {
    opacity: 0;
    height: 0;
  }
  10% {
    opacity: 0;
    height: fit-content;
  }

  100% {
    opacity: 1;
    height: fit-content;
  }
}

h1 {
  display: flex;
  font-size: 2.5rem;
  justify-content: center;
  align-items: center;

  span {
    display: inline-block;
    width: 25px;
    height: 3rem;
    background: var(--dark-text);
    animation: blink 1.5s linear infinite;
  }
}

@media screen and(max-width: 1024px) {
  .container {
    p {
      font-size: 18px;
      font-weight: bold;
      letter-spacing: 0.5px;
    }
    section {
      flex-direction: column;
      width: 100%;
      border-radius: 8px;
      border: 0;
      padding: 0;
      font-weight: bold;

      .illustration {
        padding: 20px;
        img {
          align-self: center;
          width: 100%;
        }
      }
    }
  }
}
</style>
